<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#psql" data-toc-modified-id="psql-1"><span class="toc-item-num">1&nbsp;&nbsp;</span><code>psql</code></a></span><ul class="toc-item"><li><span><a href="#psql-Customizations" data-toc-modified-id="psql-Customizations-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>psql Customizations</a></span></li><li><span><a href="#Describe-&amp;-List" data-toc-modified-id="Describe-&amp;-List-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Describe &amp; List</a></span></li><li><span><a href="#Connect" data-toc-modified-id="Connect-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Connect</a></span></li><li><span><a href="#Import-&amp;-export" data-toc-modified-id="Import-&amp;-export-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Import &amp; export</a></span></li></ul></li><li><span><a href="#Tooling" data-toc-modified-id="Tooling-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Tooling</a></span></li><li><span><a href="#⭕-Data-Types" data-toc-modified-id="⭕-Data-Types-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>⭕ Data Types</a></span><ul class="toc-item"><li><span><a href="#Numerics" data-toc-modified-id="Numerics-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Numerics</a></span><ul class="toc-item"><li><span><a href="#Serials" data-toc-modified-id="Serials-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Serials</a></span></li></ul></li><li><span><a href="#Textual" data-toc-modified-id="Textual-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Textual</a></span><ul class="toc-item"><li><span><a href="#String-Functions" data-toc-modified-id="String-Functions-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>String Functions</a></span></li></ul></li><li><span><a href="#Temporal-Data" data-toc-modified-id="Temporal-Data-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Temporal Data</a></span></li><li><span><a href="#Arrays" data-toc-modified-id="Arrays-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Arrays</a></span><ul class="toc-item"><li><span><a href="#Array-Slicing-and-Splicing" data-toc-modified-id="Array-Slicing-and-Splicing-3.4.1"><span class="toc-item-num">3.4.1&nbsp;&nbsp;</span>Array Slicing and Splicing</a></span></li><li><span><a href="#Array-Containment-Checks" data-toc-modified-id="Array-Containment-Checks-3.4.2"><span class="toc-item-num">3.4.2&nbsp;&nbsp;</span>Array Containment Checks</a></span></li></ul></li></ul></li><li><span><a href="#⭕-Identifiers" data-toc-modified-id="⭕-Identifiers-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>⭕ Identifiers</a></span></li><li><span><a href="#⭕-Database" data-toc-modified-id="⭕-Database-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>⭕ Database</a></span></li><li><span><a href="#⭕-Tables-&amp;-Indexes" data-toc-modified-id="⭕-Tables-&amp;-Indexes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>⭕ Tables &amp; Indexes</a></span></li><li><span><a href="#⭕-Database" data-toc-modified-id="⭕-Database-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>⭕ Database</a></span></li><li><span><a href="#Querying-for-Data" data-toc-modified-id="Querying-for-Data-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Querying for Data</a></span><ul class="toc-item"><li><span><a href="#DISTINCT" data-toc-modified-id="DISTINCT-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span><code>DISTINCT</code></a></span></li><li><span><a href="#WHERE-&amp;-OREDER-BY" data-toc-modified-id="WHERE-&amp;-OREDER-BY-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span><code>WHERE</code> &amp; <code>OREDER BY</code></a></span></li><li><span><a href="#AND,--OR-and-NOT" data-toc-modified-id="AND,--OR-and-NOT-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span><code>AND</code>,  <code>OR</code> and <code>NOT</code></a></span></li><li><span><a href="#BETWEEN" data-toc-modified-id="BETWEEN-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span><code>BETWEEN</code></a></span></li><li><span><a href="#Agregate-with-MIN,-MAX,-SUM-&amp;-AVG" data-toc-modified-id="Agregate-with-MIN,-MAX,-SUM-&amp;-AVG-8.5"><span class="toc-item-num">8.5&nbsp;&nbsp;</span>Agregate with <code>MIN</code>, <code>MAX</code>, <code>SUM</code> &amp; <code>AVG</code></a></span></li><li><span><a href="#Agregate-with--COUNT(*)" data-toc-modified-id="Agregate-with--COUNT(*)-8.6"><span class="toc-item-num">8.6&nbsp;&nbsp;</span>Agregate with  <code>COUNT(*)</code></a></span></li><li><span><a href="#Agregate-Group-Contcat" data-toc-modified-id="Agregate-Group-Contcat-8.7"><span class="toc-item-num">8.7&nbsp;&nbsp;</span>Agregate Group Contcat</a></span><ul class="toc-item"><li><span><a href="#⭕-TODO:-AGGREGATE" data-toc-modified-id="⭕-TODO:-AGGREGATE-8.7.1"><span class="toc-item-num">8.7.1&nbsp;&nbsp;</span>⭕ <code>TODO: AGGREGATE</code></a></span></li></ul></li><li><span><a href="#LIKE" data-toc-modified-id="LIKE-8.8"><span class="toc-item-num">8.8&nbsp;&nbsp;</span><code>LIKE</code></a></span></li><li><span><a href="#SIMILAR-TO-~" data-toc-modified-id="SIMILAR-TO-~-8.9"><span class="toc-item-num">8.9&nbsp;&nbsp;</span>SIMILAR TO <code>~</code></a></span></li><li><span><a href="#Dealing-with-NULL" data-toc-modified-id="Dealing-with-NULL-8.10"><span class="toc-item-num">8.10&nbsp;&nbsp;</span>Dealing with <code>NULL</code></a></span></li><li><span><a href="#GROUP-BY" data-toc-modified-id="GROUP-BY-8.11"><span class="toc-item-num">8.11&nbsp;&nbsp;</span><code>GROUP BY</code></a></span><ul class="toc-item"><li><span><a href="#⭕-TODO:-WITH-ROLLUP" data-toc-modified-id="⭕-TODO:-WITH-ROLLUP-8.11.1"><span class="toc-item-num">8.11.1&nbsp;&nbsp;</span>⭕ <code>TODO: WITH ROLLUP</code></a></span></li></ul></li><li><span><a href="#HAVING" data-toc-modified-id="HAVING-8.12"><span class="toc-item-num">8.12&nbsp;&nbsp;</span><code>HAVING</code></a></span></li><li><span><a href="#UNION" data-toc-modified-id="UNION-8.13"><span class="toc-item-num">8.13&nbsp;&nbsp;</span><code>UNION</code></a></span></li><li><span><a href="#INTERSECT" data-toc-modified-id="INTERSECT-8.14"><span class="toc-item-num">8.14&nbsp;&nbsp;</span><code>INTERSECT</code></a></span></li><li><span><a href="#EXCEPT" data-toc-modified-id="EXCEPT-8.15"><span class="toc-item-num">8.15&nbsp;&nbsp;</span><code>EXCEPT</code></a></span></li><li><span><a href="#RETURNING" data-toc-modified-id="RETURNING-8.16"><span class="toc-item-num">8.16&nbsp;&nbsp;</span><code>RETURNING</code></a></span></li></ul></li><li><span><a href="#⭕-Indexes" data-toc-modified-id="⭕-Indexes-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>⭕ Indexes</a></span></li><li><span><a href="#⭕-SQL-Expressions" data-toc-modified-id="⭕-SQL-Expressions-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>⭕ SQL Expressions</a></span></li><li><span><a href="#⭕-Updating-Data" data-toc-modified-id="⭕-Updating-Data-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>⭕ Updating Data</a></span></li><li><span><a href="#Joins" data-toc-modified-id="Joins-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Joins</a></span><ul class="toc-item"><li><span><a href="#INNER-JOIN" data-toc-modified-id="INNER-JOIN-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span><code>INNER JOIN</code></a></span></li><li><span><a href="#LEFT-(OUTTER)-JOIN" data-toc-modified-id="LEFT-(OUTTER)-JOIN-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span><code>LEFT (OUTTER) JOIN</code></a></span></li><li><span><a href="#LEFT-(OUTTER)-JOIN-*" data-toc-modified-id="LEFT-(OUTTER)-JOIN-*-12.3"><span class="toc-item-num">12.3&nbsp;&nbsp;</span><code>LEFT (OUTTER) JOIN</code> <sup>*</sup></a></span></li><li><span><a href="#RIGHT-(OUTTER)-JOIN" data-toc-modified-id="RIGHT-(OUTTER)-JOIN-12.4"><span class="toc-item-num">12.4&nbsp;&nbsp;</span><code>RIGHT (OUTTER) JOIN</code></a></span></li><li><span><a href="#RIGHT-(OUTTER)-JOIN-*" data-toc-modified-id="RIGHT-(OUTTER)-JOIN-*-12.5"><span class="toc-item-num">12.5&nbsp;&nbsp;</span><code>RIGHT (OUTTER) JOIN</code> <sup>*</sup></a></span></li><li><span><a href="#FULL-JOIN" data-toc-modified-id="FULL-JOIN-12.6"><span class="toc-item-num">12.6&nbsp;&nbsp;</span><code>FULL JOIN</code></a></span></li><li><span><a href="#CROSS-JOIN" data-toc-modified-id="CROSS-JOIN-12.7"><span class="toc-item-num">12.7&nbsp;&nbsp;</span><code>CROSS JOIN</code></a></span></li><li><span><a href="#SELF-JOIN" data-toc-modified-id="SELF-JOIN-12.8"><span class="toc-item-num">12.8&nbsp;&nbsp;</span><code>SELF JOIN</code></a></span></li><li><span><a href="#USING-keyword" data-toc-modified-id="USING-keyword-12.9"><span class="toc-item-num">12.9&nbsp;&nbsp;</span><code>USING</code> keyword</a></span></li><li><span><a href="#NATURAL-JOIN" data-toc-modified-id="NATURAL-JOIN-12.10"><span class="toc-item-num">12.10&nbsp;&nbsp;</span><code>NATURAL JOIN</code></a></span></li></ul></li><li><span><a href="#SubQueries" data-toc-modified-id="SubQueries-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>SubQueries</a></span><ul class="toc-item"><li><span><a href="#EXISTS" data-toc-modified-id="EXISTS-13.1"><span class="toc-item-num">13.1&nbsp;&nbsp;</span><code>EXISTS</code></a></span></li><li><span><a href="#ANY" data-toc-modified-id="ANY-13.2"><span class="toc-item-num">13.2&nbsp;&nbsp;</span><code>ANY</code></a></span></li></ul></li><li><span><a href="#⭕-Views" data-toc-modified-id="⭕-Views-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>⭕ Views</a></span><ul class="toc-item"><li><span><a href="#Droping-Views" data-toc-modified-id="Droping-Views-14.1"><span class="toc-item-num">14.1&nbsp;&nbsp;</span>Droping Views</a></span></li><li><span><a href="#Create-Or-Replace-Views" data-toc-modified-id="Create-Or-Replace-Views-14.2"><span class="toc-item-num">14.2&nbsp;&nbsp;</span>Create Or Replace Views</a></span></li><li><span><a href="#Inserting-Into-the-Views" data-toc-modified-id="Inserting-Into-the-Views-14.3"><span class="toc-item-num">14.3&nbsp;&nbsp;</span>Inserting Into the Views</a></span><ul class="toc-item"><li><span><a href="#TODO:-Adding-checks-to-prevent-bypassing-filters" data-toc-modified-id="TODO:-Adding-checks-to-prevent-bypassing-filters-14.3.1"><span class="toc-item-num">14.3.1&nbsp;&nbsp;</span>TODO: Adding checks to prevent bypassing filters</a></span></li></ul></li></ul></li><li><span><a href="#⭕-Importing-and-Exporting-data" data-toc-modified-id="⭕-Importing-and-Exporting-data-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>⭕ Importing and Exporting data</a></span></li><li><span><a href="#⭕-User-Variables" data-toc-modified-id="⭕-User-Variables-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>⭕ User Variables</a></span></li><li><span><a href="#⭕-Prepared-Statements" data-toc-modified-id="⭕-Prepared-Statements-17"><span class="toc-item-num">17&nbsp;&nbsp;</span>⭕ Prepared Statements</a></span></li><li><span><a href="#⭕-Stored-Procedures-and-Functions" data-toc-modified-id="⭕-Stored-Procedures-and-Functions-18"><span class="toc-item-num">18&nbsp;&nbsp;</span>⭕ Stored Procedures and Functions</a></span><ul class="toc-item"><li><span><a href="#⭕-Procedures" data-toc-modified-id="⭕-Procedures-18.1"><span class="toc-item-num">18.1&nbsp;&nbsp;</span>⭕ Procedures</a></span></li><li><span><a href="#Functions:-SQL" data-toc-modified-id="Functions:-SQL-18.2"><span class="toc-item-num">18.2&nbsp;&nbsp;</span>Functions: SQL</a></span><ul class="toc-item"><li><span><a href="#OUT-parameters" data-toc-modified-id="OUT-parameters-18.2.1"><span class="toc-item-num">18.2.1&nbsp;&nbsp;</span><code>OUT</code> parameters</a></span></li><li><span><a href="#DEFAULT-parameters" data-toc-modified-id="DEFAULT-parameters-18.2.2"><span class="toc-item-num">18.2.2&nbsp;&nbsp;</span>DEFAULT parameters</a></span></li><li><span><a href="#DECLARE-Variables" data-toc-modified-id="DECLARE-Variables-18.2.3"><span class="toc-item-num">18.2.3&nbsp;&nbsp;</span><code>DECLARE</code> Variables</a></span></li><li><span><a href="#⭕-TODO-IF/ELSEIF" data-toc-modified-id="⭕-TODO-IF/ELSEIF-18.2.4"><span class="toc-item-num">18.2.4&nbsp;&nbsp;</span>⭕ TODO IF/ELSEIF</a></span></li><li><span><a href="#SETOF-[table]" data-toc-modified-id="SETOF-[table]-18.2.5"><span class="toc-item-num">18.2.5&nbsp;&nbsp;</span>SETOF <code>[table]</code></a></span></li></ul></li><li><span><a href="#RETURN-NEXT" data-toc-modified-id="RETURN-NEXT-18.3"><span class="toc-item-num">18.3&nbsp;&nbsp;</span><code>RETURN NEXT</code></a></span></li><li><span><a href="#Quick-Proofing" data-toc-modified-id="Quick-Proofing-18.4"><span class="toc-item-num">18.4&nbsp;&nbsp;</span>Quick Proofing</a></span></li></ul></li><li><span><a href="#Counter" data-toc-modified-id="Counter-19"><span class="toc-item-num">19&nbsp;&nbsp;</span>Counter</a></span></li><li><span><a href="#⭕-Built-in-Functions" data-toc-modified-id="⭕-Built-in-Functions-20"><span class="toc-item-num">20&nbsp;&nbsp;</span>⭕ Built-in Functions</a></span><ul class="toc-item"><li><span><a href="#regexp_matches" data-toc-modified-id="regexp_matches-20.1"><span class="toc-item-num">20.1&nbsp;&nbsp;</span><code>regexp_matches</code></a></span></li><li><span><a href="#NULLIF(a,b)---returns-NULL-if-a-==-b" data-toc-modified-id="NULLIF(a,b)---returns-NULL-if-a-==-b-20.2"><span class="toc-item-num">20.2&nbsp;&nbsp;</span><code>NULLIF(a,b)</code> - returns <code>NULL</code> if <code>a == b</code></a></span></li><li><span><a href="#COALESCE(a,b)---prefer-b-if-a-==-null" data-toc-modified-id="COALESCE(a,b)---prefer-b-if-a-==-null-20.3"><span class="toc-item-num">20.3&nbsp;&nbsp;</span><code>COALESCE(a,b)</code> - prefer <code>b</code> if <code>a == null</code></a></span></li><li><span><a href="#CASE-...-END---if-else-blocks" data-toc-modified-id="CASE-...-END---if-else-blocks-20.4"><span class="toc-item-num">20.4&nbsp;&nbsp;</span><code>CASE</code> ... <code>END</code> - if else blocks</a></span></li></ul></li><li><span><a href="#⭕-Triggers" data-toc-modified-id="⭕-Triggers-21"><span class="toc-item-num">21&nbsp;&nbsp;</span>⭕ Triggers</a></span></li><li><span><a href="#⭕-DataBase-Metadata" data-toc-modified-id="⭕-DataBase-Metadata-22"><span class="toc-item-num">22&nbsp;&nbsp;</span>⭕ DataBase Metadata</a></span></li><li><span><a href="#⭕-Document-Model" data-toc-modified-id="⭕-Document-Model-23"><span class="toc-item-num">23&nbsp;&nbsp;</span>⭕ Document Model</a></span></li></ul></div>

In [1]:
%load_ext sql

In [2]:
%sql postgresql://user:password@postgresql:5432/northwind

'Connected: user@northwind'

## `psql`

In [3]:
# not supported
# %sql \?

In [4]:
%sql \d

 * postgresql://user:***@postgresql:5432/northwind
15 rows affected.

[('public', 'categories', 'table', 'user'),
 ('public', 'customer_customer_demo', 'table', 'user'),
 ('public', 'customer_demographics', 'table', 'user'),
 ('public', 'customers', 'table', 'user'),
 ('public', 'employee_territories', 'table', 'user'),
 ('public', 'employees', 'table', 'user'),
 ('public', 'order_details', 'table', 'user'),
 ('public', 'orders', 'table', 'user'),
 ('public', 'perf_test', 'table', 'user'),
 ('public', 'products', 'table', 'user'),
 ('public', 'region', 'table', 'user'),
 ('public', 'shippers', 'table', 'user'),
 ('public', 'suppliers', 'table', 'user'),
 ('public', 'territories', 'table', 'user'),
 ('public', 'us_states', 'table', 'user')]

- `\t` - tuples only
- `\a` - no extra breaking elements (added by psql)
- `\q query.sql` - rediect to sql.
- `\o`  stop redirection.
- `\i query.sql` - execute generated script

### psql Customizations

```
\pset null 'NULL'
\encoding latin1
\set PROMPT1 '%n@%M:%>%x %/# '
\pset pager always
\timing on
\set qstats92 '
    SELECT usename, datname, left(query,100) || ''...'' As query
    FROM pg_stat_activity WHERE state != ''idle'' ;
```

 - `\timing` setting timing for queryies on
 - `\set AUTOCOMMIT off`

### Describe & List

In [5]:
%sql \dt

 * postgresql://user:***@postgresql:5432/northwind
15 rows affected.

[('public', 'categories', 'table', 'user'),
 ('public', 'customer_customer_demo', 'table', 'user'),
 ('public', 'customer_demographics', 'table', 'user'),
 ('public', 'customers', 'table', 'user'),
 ('public', 'employee_territories', 'table', 'user'),
 ('public', 'employees', 'table', 'user'),
 ('public', 'order_details', 'table', 'user'),
 ('public', 'orders', 'table', 'user'),
 ('public', 'perf_test', 'table', 'user'),
 ('public', 'products', 'table', 'user'),
 ('public', 'region', 'table', 'user'),
 ('public', 'shippers', 'table', 'user'),
 ('public', 'suppliers', 'table', 'user'),
 ('public', 'territories', 'table', 'user'),
 ('public', 'us_states', 'table', 'user')]

In [6]:
%sql \dt pg_catalog.pg_t*

 * postgresql://user:***@postgresql:5432/northwind
9 rows affected.

[('pg_catalog', 'pg_tablespace', 'table', 'user'),
 ('pg_catalog', 'pg_transform', 'table', 'user'),
 ('pg_catalog', 'pg_trigger', 'table', 'user'),
 ('pg_catalog', 'pg_ts_config', 'table', 'user'),
 ('pg_catalog', 'pg_ts_config_map', 'table', 'user'),
 ('pg_catalog', 'pg_ts_dict', 'table', 'user'),
 ('pg_catalog', 'pg_ts_parser', 'table', 'user'),
 ('pg_catalog', 'pg_ts_template', 'table', 'user'),
 ('pg_catalog', 'pg_type', 'table', 'user')]

In [7]:
# db list
%sql \l

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('northwind', 'user', 'UTF8', 'en_US.utf8', 'en_US.utf8', None),
 ('postgres', 'user', 'UTF8', 'en_US.utf8', 'en_US.utf8', None),
 ('template0',
  'user',
  'UTF8',
  'en_US.utf8',
  'en_US.utf8',
  '=c/user\nuser=CTc/user'),
 ('template1',
  'user',
  'UTF8',
  'en_US.utf8',
  'en_US.utf8',
  '=c/user\nuser=CTc/user')]

In [8]:
%sql \d+

 * postgresql://user:***@postgresql:5432/northwind
15 rows affected.

[('public', 'categories', 'table', 'user', '16 kB', None),
 ('public', 'customer_customer_demo', 'table', 'user', '8192 bytes', None),
 ('public', 'customer_demographics', 'table', 'user', '8192 bytes', None),
 ('public', 'customers', 'table', 'user', '48 kB', None),
 ('public', 'employee_territories', 'table', 'user', '8192 bytes', None),
 ('public', 'employees', 'table', 'user', '16 kB', None),
 ('public', 'order_details', 'table', 'user', '128 kB', None),
 ('public', 'orders', 'table', 'user', '144 kB', None),
 ('public', 'perf_test', 'table', 'user', '1616 MB', None),
 ('public', 'products', 'table', 'user', '8192 bytes', None),
 ('public', 'region', 'table', 'user', '16 kB', None),
 ('public', 'shippers', 'table', 'user', '8192 bytes', None),
 ('public', 'suppliers', 'table', 'user', '16 kB', None),
 ('public', 'territories', 'table', 'user', '16 kB', None),
 ('public', 'us_states', 'table', 'user', '8192 bytes', None)]

In [9]:
# not supported by jupyter
# %sql \d+ table_name

### Connect

`\c pg_catalog` - coonect ot db

### Import & export

* `copy table_name FROM file.txt DELIMITER '|';` 
* `copy table_name FROM file.csv;`
* `copy table_name FROM file.csv NULL AS '';`

```
\copy (SELECT * FROM staging.factfinder_import  WHERE s01 ~ E'^[0-9]+' ) 
TO '/test.tab'
WITH DELIMITER E'\t' CSV HEADER
```

```
-- double quote all columns
\copy staging.factfinder_import TO '/test.csv'
WITH CSV HEADER QUOTE '"' FORCE QUOTE *
```

Export as html with `-H` option.

## Tooling

* https://rextester.com/l/postgresql_online_compiler

## ⭕ Data Types

### Numerics

#### Serials

In [108]:
%%sql

DROP SEQUENCE IF EXISTS s; 
CREATE SEQUENCE s START 1;

DROP TABLE IF EXISTS stuff ;
CREATE TABLE stuff(
    id bigint DEFAULT nextval('s') PRIMARY KEY, name text);

 * postgresql://user:***@postgresql:5432/northwind
Done.
Done.
Done.
Done.

[]

In [110]:
%sql SELECT nextval('s')

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(1,)]

In [115]:
%sql SELECT x FROM generate_series(1,51,20) AS x;

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[(1,), (21,), (41,)]

### Textual

#### String Functions

In [117]:
%%sql 

SELECT
    lpad('ab', 4, '0') AS ab_lpad,
    rpad('ab', 4, '0') AS ab_rpad,
    lpad('abcde', 4, '0') AS ab_lpad_trunc;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('00ab', 'ab00', 'abcd')]

In [121]:
%%sql

SELECT
    -- different trim types
    a as a_before, trim(a) as a_trim, rtrim(a) as a_rt,
    i as i_before, ltrim(i, '0') AS i_lt_0,
    rtrim(i, '0') as i_rt_0, trim(i, '0') AS i_t_0
FROM (
    -- concat with padding 4 spacing a number...
	SELECT 
        repeat(' ', 4) || i || repeat(' ', 4) As a, 
        '0' || i As i
	FROM generate_series(0, 200, 50) AS i
) As x;

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('    0    ', '0', '    0', '00', '', '', ''),
 ('    50    ', '50', '    50', '050', '50', '05', '5'),
 ('    100    ', '100', '    100', '0100', '100', '01', '1'),
 ('    150    ', '150', '    150', '0150', '150', '015', '15'),
 ('    200    ', '200', '    200', '0200', '200', '02', '2')]

In [122]:
%sql SELECT split_part('abc.123.z45','.',2) AS x;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('123',)]

In [126]:
%%sql 
SELECT unnest(string_to_array('abc.123.z45', '.')) AS x;

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('abc',), ('123',), ('z45',)]

In [127]:
%%sql

SELECT regexp_replace( '6197306254',
    '([0-9]{3})([0-9]{3})([0-9]{4})',
     E'\(\\1\) \\2-\\3'
) AS x;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('(619) 730-6254',)]

In [128]:
%%sql

SELECT unnest(
    regexp_matches(
    'Cell (619) 852-5083. Work (619)123-4567 , Casa 619-730-6254. Bésame mucho.',
    E'[(]{0,1}[0-9]{3}[)-.]{0,1}[\\s]{0,1}[0-9]{3}[-.]{0,1}[0-9]{4}', 'g')
) AS x

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('(619) 852-5083',), ('(619)123-4567',), ('619-730-6254',)]

In [129]:
%%sql

SELECT substring(
    'Cell (619) 852-5083. Work (619)123-4567 , Casa 619-730-6254. Bésame mucho.'
    FROM E'[(]{0,1}[0-9]{3}[)-.]{0,1}[\\s]{0,1}[0-9]{3}[-.]{0,1}[0-9]{4}'
) AS x;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('(619) 852-5083',)]

### Temporal Data

- `date` - Stores the month, day, and year, with no time zone awareness and no concept of hours, minutes, or seconds.
- `time` (aka `time without time zone`): Stores hours, minutes, and seconds with no awareness of time zone or calendar dates.
- `timestamp` (aka `timestamp without time zone`): Stores both calendar dates and time (hours, minutes, seconds) but does not care about the time zone.
- `timestamptz` (aka `timestamp with time zone`): A time zone−aware date and time data type. Internally, timestamptz is stored in Coordinated Universal Time (UTC), but its display defaults to the time zone of the server, the service config, the database, the user, or the session. Yes, you can observe different time zones at different levels. If you input a timestamp with no time zone and cast it to one with the time zone, PostgreSQL assumes the default time zone in effect. If you don’t set your time zone in postgresql.conf, the server’s default takes effect. This means that if you change your server’s time zone, you’ll see all the displayed times change after the PostgreSQL restarts.
- `timetz` (aka `time with time zone`): The lesser-used sister of timestamptz. It is time zone−aware but does not store the date. It always assumes DST of the current date and time. Some programming languages with no concept of time without date might map `timetz` to a timestamp with some arbitrary date such as Unix Epoch 1970, resulting in year 1970 being assumed.
- `interval`: A duration of time in hours, days, months, minutes, and others. It comes in handy for datetime arithmetic. For example, if the world is supposed to end in exactly 666 days from now, all you have to do is add an interval of 666 days to the current time to get the exact moment (and plan accordingly).
- `tsrange`: Allows you to define opened and closed ranges of timestamp with no timezone. The type consists of two timestamps and opened/closed range qualifiers. For example, `'[2012-01-01 14:00, 2012-01-01 15:00)'::tsrange` defines a period starting at 14:00 but ending before 15:00. Refer to Range Types for details.
- `tstzrange`: Allows you to define opened and closed ranges of timestamp with timezone.
- `daterange`: Allows you to define opened and closed ranges of dates.

In [138]:
%%sql 

SELECT '2012-03-11 3:10 AM America/Los_Angeles'::timestamptz
 - '2012-03-11 1:50 AM America/Los_Angeles'::timestamptz;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.timedelta(seconds=1200),)]

In [137]:
%%sql

 
SELECT '2012-03-11 3:10 AM'::timestamp - '2012-03-11 1:50 AM'::timestamp;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.timedelta(seconds=4800),)]

In [145]:
%sql SELECT '2012-02-28 10:00 PM America/Los_Angeles'::timestamptz

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.datetime(2012, 2, 29, 6, 0, tzinfo=datetime.timezone.utc),)]

In [144]:
%sql SELECT '2012-02-28 10:00 PM America/Los_Angeles'::timestamptz AT TIME ZONE 'Europe/Paris';

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.datetime(2012, 2, 29, 7, 0),)]

In [141]:
%sql SELECT '2012-02-10 11:00 PM'::timestamp + interval '1 hour'

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.datetime(2012, 2, 11, 0, 0),)]

In [140]:
%sql SELECT '23 hours 20 minutes'::interval + '1 hour'::interval;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.timedelta(days=1, seconds=1200),)]

In [139]:
%sql SELECT '2012-02-10 11:00 PM'::timestamptz - interval '1 hour';

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.datetime(2012, 2, 10, 22, 0, tzinfo=datetime.timezone.utc),)]

In [147]:
%%sql 

SELECT
('2012-10-25 10:00 AM'::timestamp, '2012-10-25 2:00 PM'::timestamp)
OVERLAPS
('2012-10-25 11:00 AM'::timestamp,'2012-10-26 2:00 PM'::timestamp) AS x,
--- other variation
('2012-10-25'::date,'2012-10-26'::date)
OVERLAPS
('2012-10-26'::date,'2012-10-27'::date) AS y;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(True, False)]

In [150]:
%%sql

SELECT (dt - interval '1 day')::date As eom
FROM generate_series('2/1/2012', '4/30/2012', interval '1 month') As dt;

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[(datetime.date(2012, 1, 31),),
 (datetime.date(2012, 2, 29),),
 (datetime.date(2012, 3, 31),)]

In [154]:
%%sql

SELECT dt, 
date_part('hour', dt) As hr, 
to_char(dt,'HH12:MI AM') As mn
FROM
generate_series(
	'2012-03-11 12:30 AM',
	'2012-03-11 1:20 AM',
	interval '15 minutes'
) As dt;

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[(datetime.datetime(2012, 3, 11, 0, 30, tzinfo=datetime.timezone.utc), 0.0, '12:30 AM'),
 (datetime.datetime(2012, 3, 11, 0, 45, tzinfo=datetime.timezone.utc), 0.0, '12:45 AM'),
 (datetime.datetime(2012, 3, 11, 1, 0, tzinfo=datetime.timezone.utc), 1.0, '01:00 AM'),
 (datetime.datetime(2012, 3, 11, 1, 15, tzinfo=datetime.timezone.utc), 1.0, '01:15 AM')]

### Arrays

In [155]:
%sql SELECT ARRAY[2001, 2002, 2003] As yrs;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[([2001, 2002, 2003],)]

In [156]:
%%sql
-- need datetime column
-- SELECT array(
--     SELECT DISTINCT date_part('year', log_ts)
--     FROM logs
--     ORDER BY date_part('year', log_ts)
-- );

 * postgresql://user:***@postgresql:5432/northwind
(psycopg2.errors.UndefinedTable) relation "logs" does not exist
LINE 3:     FROM logs
                 ^

[SQL: SELECT array(
    SELECT DISTINCT date_part('year', log_ts)
    FROM logs
    ORDER BY date_part('year', log_ts)
);]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [157]:
%sql SELECT string_to_array('CA.MA.TX', '.') As estados;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(['CA', 'MA', 'TX'],)]

In [158]:
%sql SELECT '{Alex,Sonia}'::text[] As name, '{46,43}'::smallint[] As age;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(['Alex', 'Sonia'], [46, 43])]

In [ ]:
--- log ts
SELECT array_agg(log_ts ORDER BY log_ts) As x
FROM logs
WHERE log_ts BETWEEN '2011-01-01'::timestamptz AND '2011-01-15'::timestamptz;”

In [ ]:
“SELECT array_agg(f.t)
 FROM ( VALUES ('{Alex,Sonia}'::text[]),
    ('{46,43}'::text[] ) ) As f(t);”

Excerpt From: Regina O. Obe. “PostgreSQL.” Apple Books.

In [164]:
%sql SELECT unnest('{XOX, OXO, XOX}'::char(3)[]) As tic_tac_toe;

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('XOX',), ('OXO',), ('XOX',)]

In [160]:
%%sql 

SELECT
    unnest( '{blind,mouse}'::varchar[]) AS v,
    unnest('{1,2,3}'::smallint[]) AS i;

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('blind', 1), ('mouse', 2), (None, 3)]

In [159]:
%sql SELECT * FROM unnest('{blind,mouse}'::text[], '{1,2,3}'::int[]) AS f(t,i);

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('blind', 1), ('mouse', 2), (None, 3)]

#### Array Slicing and Splicing

In [165]:
%%sql 
SELECT fact_subcats[2:4] FROM census.lu_fact_types;

 * postgresql://user:***@postgresql:5432/northwind
(psycopg2.errors.UndefinedTable) relation "census.lu_fact_types" does not exist
LINE 1: SELECT fact_subcats[2:4] FROM census.lu_fact_types;
                                      ^

[SQL: SELECT fact_subcats[2:4] FROM census.lu_fact_types;]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [ ]:
SELECT fact_subcats[1:2] || fact_subcats[3:4] FROM census.lu_fact_types

In [169]:
%%sql 

SELECT '{1,2,3}'::integer[] || 4 || 5 AS x;

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[([1, 2, 3, 4, 5],)]

In [ ]:
SELECT
    fact_subcats[1] AS primero,
    fact_subcats[array_upper(fact_subcats, 1)] As segundo
FROM census.lu_fact_types;

#### Array Containment Checks

`=`, `<>`, `<`, `>`, `@>`, `<@`, and `&&`.

In [ ]:
page 139

## ⭕ Identifiers

## ⭕ Database

## ⭕ Tables & Indexes

## ⭕ Database

## Querying for Data

```
SELECT values_to_display
 FROM table_anme
 WHERE expression
 GROUP BY how_to_group
 HAVING expression
 ORDER BY how_to_group
 LIMIT row_limit;
```

In [11]:
%%sql 

SELECT product_id, product_name, quantity_per_unit, unit_price FROM "products" LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(1, 'Chai', '10 boxes x 30 bags', 18.0),
 (2, 'Chang', '24 - 12 oz bottles', 19.0),
 (3, 'Aniseed Syrup', '12 - 550 ml bottles', 10.0),
 (4, "Chef Anton's Cajun Seasoning", '48 - 6 oz jars', 22.0),
 (5, "Chef Anton's Gumbo Mix", '36 boxes', 21.35)]

Using math in SQL

* `+` - addition
* `-` - вsubtraction
* `*` - multiplier
* `/` - division
* `^` - power
* `|/` - quadratic power

In [12]:
%sql SELECT product_id, product_name, units_in_stock * unit_price as price  FROM "products" LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(1, 'Chai', 702.0),
 (2, 'Chang', 323.0),
 (3, 'Aniseed Syrup', 130.0),
 (4, "Chef Anton's Cajun Seasoning", 1166.0),
 (5, "Chef Anton's Gumbo Mix", 0.0)]

### `DISTINCT`

In [13]:
%sql SELECT DISTINCT city FROM employees

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Redmond',), ('London',), ('Tacoma',), ('Kirkland',), ('Seattle',)]

In [14]:
%sql SELECT DISTINCT city, country FROM employees

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Seattle', 'USA'),
 ('Kirkland', 'USA'),
 ('London', 'UK'),
 ('Redmond', 'USA'),
 ('Tacoma', 'USA')]

### `WHERE` & `OREDER BY`

In [15]:
%%sql 

SELECT order_id, customer_id, order_date, shipped_date FROM orders WHERE ship_city = 'Oulu' LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(10266, 'WARTH', datetime.date(1996, 7, 26), datetime.date(1996, 7, 31)),
 (10270, 'WARTH', datetime.date(1996, 8, 1), datetime.date(1996, 8, 2)),
 (10320, 'WARTH', datetime.date(1996, 10, 3), datetime.date(1996, 10, 18)),
 (10333, 'WARTH', datetime.date(1996, 10, 18), datetime.date(1996, 10, 25)),
 (10412, 'WARTH', datetime.date(1997, 1, 13), datetime.date(1997, 1, 15))]

In [16]:
%%sql 

SELECT ship_country, ship_city, freight FROM orders WHERE ship_city != 'Oulu' AND freight > 30 ORDER BY freight DESC LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Germany', 'Cunewalde', 1007.64),
 ('Brazil', 'Sao Paulo', 890.78),
 ('USA', 'Boise', 830.75),
 ('Germany', 'Cunewalde', 810.05)]

In [17]:
%sql SELECT ship_country, ship_city, freight FROM orders WHERE ship_city <> 'Oulu' AND freight > 30 LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('France', 'Reims', 32.38),
 ('Brazil', 'Rio de Janeiro', 65.83),
 ('France', 'Lyon', 41.34),
 ('Belgium', 'Charleroi', 51.3)]

In [18]:
%sql SELECT ship_country, ship_city, freight FROM orders WHERE order_date > '1998-04-10' LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Austria', 'Graz', 754.26),
 ('USA', 'Portland', 11.65),
 ('Argentina', 'Buenos Aires', 3.17),
 ('Germany', 'Köln', 43.3)]

### `AND`,  `OR` and `NOT`

In [19]:
%%sql 

SELECT customer_id, company_name, contact_name, contact_title, address, city 
FROM customers 
WHERE city = 'London' OR city = 'Berlin' LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin'),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London'),
 ('BSBEV', "B's Beverages", 'Victoria Ashworth', 'Sales Representative', 'Fauntleroy Circus', 'London'),
 ('CONSH', 'Consolidated Holdings', 'Elizabeth Brown', 'Sales Representative', 'Berkeley Gardens 12  Brewery', 'London')]

In [20]:
%%sql 

SELECT product_id, product_name, supplier_id, category_id, quantity_per_unit, unit_price, units_in_stock 
FROM products WHERE (units_in_stock < units_on_order ) OR ( discontinued = 1 ) LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0)]

In [21]:

%%sql 

SELECT customer_id, company_name, contact_name, contact_title, address, city 
FROM customers WHERE city = 'London' OR city = 'Berlin' LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin'),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London'),
 ('BSBEV', "B's Beverages", 'Victoria Ashworth', 'Sales Representative', 'Fauntleroy Circus', 'London'),
 ('CONSH', 'Consolidated Holdings', 'Elizabeth Brown', 'Sales Representative', 'Berkeley Gardens 12  Brewery', 'London')]

In [22]:
%%sql 

SELECT customer_id, company_name, contact_name, contact_title, address, city 
FROM customers WHERE city NOT IN ('London', 'Berlin') LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå'),
 ('BLAUS', 'Blauer See Delikatessen', 'Hanna Moos', 'Sales Representative', 'Forsterstr. 57', 'Mannheim')]

### `BETWEEN`

In [23]:
%%sql 

SELECT * FROM (
    SELECT o.customer_id, SUM(od.unit_price * od.quantity) as tot 
    FROM orders as o, order_details as od 
    WHERE od.order_id = o.order_id 
    GROUP BY o.customer_id
) as data
WHERE data.tot BETWEEN 5000 AND 6500 LIMIT  3

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('MORGK', 5042.200035095215),
 ('WELLI', 6480.69997215271),
 ('PRINI', 5317.100019454956)]

### Agregate with `MIN`, `MAX`, `SUM` & `AVG`

In [24]:
%sql SELECT MIN(order_date), MAX(order_date) FROM orders  WHERE ship_city = 'London'

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(datetime.date(1996, 8, 26), datetime.date(1998, 4, 29))]

In [25]:
%sql SELECT AVG(unit_price) FROM products

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(28.83389609200614,)]

In [26]:
%sql SELECT SUM(units_in_stock*unit_price) as price FROM products

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(73953.34993171692,)]

### Agregate with  `COUNT(*)`

In [27]:
%sql SELECT COUNT(DISTINCT ship_city) FROM orders

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(70,)]

### Agregate Group Contcat

Alternative to `GROUP_CONCAT`

#### ⭕ `TODO: AGGREGATE`

In [28]:
%%sql 

CREATE AGGREGATE group_concat (anyelement)
(
    sfunc = array_append,
    stype = anyarray,
    initcond = '{}'
);

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [29]:
%sql SELECT customer_id, group_concat(DISTINCT ship_city) FROM orders   GROUP BY customer_id LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('ALFKI', ['Berlin']),
 ('ANATR', ['México D.F.']),
 ('ANTON', ['México D.F.']),
 ('AROUT', ['Colchester']),
 ('BERGS', ['Luleå'])]

### `LIKE`

* `%` (0...)
* `_` (1)

Examples:
* LIKE "%john%" -- contains john
* LIKE "john%" -- start with john
* LIKE "%john" -- ends on john

In [30]:
%%sql 

SELECT first_name, last_name FROM employees WHERE last_name LIKE '_avolio' OR last_name LIKE  '%King%'

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Nancy', 'Davolio'), ('Robert', 'King')]

### SIMILAR TO `~`

In [134]:
%%sql 

SELECT customer_id, phone
FROM customers
WHERE phone ~  
E'[(]{0,1}[0-9]{3}[)-.]{0,1}[\\s]{0,1}[0-9]{3}[-.]{0,1}[0-9]{4}'
LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('ALFKI', '030-0074321'),
 ('AROUT', '(171) 555-7788'),
 ('BOTTM', '(604) 555-4729'),
 ('BSBEV', '(171) 555-1212')]

### Dealing with `NULL`

In [31]:
%sql SELECT ship_city, ship_region, ship_country FROM orders WHERE ship_region is NULL LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Reims', None, 'France'), ('Münster', None, 'Germany')]

In [32]:
%sql SELECT ship_city, ship_region, ship_country FROM orders WHERE ship_region is NOT NULL LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Rio de Janeiro', 'RJ', 'Brazil'), ('Rio de Janeiro', 'RJ', 'Brazil')]

### `GROUP BY`

In [33]:
%sql SELECT ship_country, count(*) FROM orders WHERE freight > 10 GROUP by ship_country ORDER BY count DESC LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Germany', 104), ('USA', 104), ('Brazil', 62), ('France', 55), ('UK', 41)]

#### ⭕ `TODO: WITH ROLLUP`

### `HAVING`

_Post selection group_

In [34]:
%%sql 

SELECT * FROM (
    SELECT o.customer_id, SUM(od.unit_price * od.quantity) as tot 
    FROM orders as o, order_details as od 
    WHERE od.order_id = o.order_id 
    GROUP BY o.customer_id
) as data
WHERE data.tot BETWEEN 5000 AND 6500

 * postgresql://user:***@postgresql:5432/northwind
7 rows affected.

[('MORGK', 5042.200035095215),
 ('WELLI', 6480.69997215271),
 ('PRINI', 5317.100019454956),
 ('ISLAT', 6146.299984931946),
 ('BOLID', 5297.800024032593),
 ('SANTG', 5735.1500153541565),
 ('BSBEV', 6089.899990081787)]

In [35]:
%%sql 

SELECT o.customer_id, SUM(od.unit_price * od.quantity)
FROM orders as o, order_details as od 
WHERE od.order_id = o.order_id 
GROUP BY o.customer_id
HAVING SUM(od.unit_price * od.quantity) BETWEEN 5000 AND 6500
ORDER BY sum

 * postgresql://user:***@postgresql:5432/northwind
7 rows affected.

[('MORGK', 5042.200035095215),
 ('BOLID', 5297.800024032593),
 ('PRINI', 5317.100019454956),
 ('SANTG', 5735.1500153541565),
 ('BSBEV', 6089.899990081787),
 ('ISLAT', 6146.299984931946),
 ('WELLI', 6480.69997215271)]

### `UNION`

_The SQL UNION clause/operator is used to combine the results of two or more SELECT statements without returning any duplicate rows._

In [36]:
%%sql 

SELECT * FROM (
    SELECT country FROM customers
    UNION
    SELECT country FROM employees
) as source LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Italy',), ('Venezuela',)]

Th `UNION ALL` command combines the result set of two or more SELECT statements (allows duplicate values).

In [37]:
%%sql 

-- do not remove duplicates

SELECT * FROM (
    SELECT country FROM customers
    UNION ALL
    SELECT country FROM employees
) as source LIMIT 3

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Germany',), ('Mexico',), ('Mexico',)]

### `INTERSECT`

_The SQL INTERSECT clause/operator is used to combine two SELECT statements, but returns rows only from the first SELECT statement that are identical to a row in the second SELECT statement. This means INTERSECT returns only common rows returned by the two SELECT statements._

In [38]:
%%sql 

SELECT * FROM (
    SELECT country FROM customers
    INTERSECT
    SELECT country FROM employees
) as source LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('UK',), ('USA',)]

### `EXCEPT`

_The SQL EXCEPT clause/operator is used to combine two SELECT statements and returns rows from the first SELECT statement that are not returned by the second SELECT statement. This means EXCEPT returns only rows, which are not available in the second SELECT statement._

In [39]:
%%sql 

-- do not remove duplicates

SELECT * FROM (
    SELECT country FROM customers
    EXCEPT
    SELECT country FROM employees
) as source LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Argentina',), ('Spain',)]

In [40]:
%%sql 

-- do not remove duplicates

SELECT * FROM (
    SELECT country FROM customers
    EXCEPT ALL
    SELECT country FROM employees
) as source LIMIT 2

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Argentina',), ('Argentina',)]

### `RETURNING`

<div class="alert alert-warning">WARNING: Jupyter doesnt work correctly with <code>returning *</code>, so we are wrpapping it</div>

* https://www.postgresql.org/docs/13/dml-returning.html

In [41]:
data =%sql UPDATE employees SET title_of_courtesy = 'Mrs' WHERE employee_id = 1 RETURNING *
data[0]

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

(1, 'Davolio', 'Nancy', 'Sales Representative', 'Mrs', datetime.date(1948, 12, 8), datetime.date(1992, 5, 1), '507 - 20th Ave. E.\\nApt. 2A', 'Seattle', 'WA', '98122', 'USA', '(206) 555-9857', '5467', <memory at 0x7f5a92c41c40>, 'Education includes a BA in psychology from Colorado State University in 1970.  She also completed The Art of the Cold Call.  Nancy is a member of Toastmasters International.', 2, 'http://accweb/emmployees/davolio.bmp')

In [42]:
%sql UPDATE employees SET title_of_courtesy = 'Mrs' WHERE employee_id = 1 RETURNING title_of_courtesy, last_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('Mrs', 'Davolio')]

In [43]:
%sql UPDATE employees SET title_of_courtesy = 'Ms' WHERE employee_id = 1 RETURNING title_of_courtesy, last_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('Ms', 'Davolio')]

In [44]:
%%sql

INSERT INTO employees (employee_id, first_name, last_name)
VALUES (10, 'John', 'Dow')
RETURNING title_of_courtesy, first_name, last_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(None, 'John', 'Dow')]

In [45]:
%sql UPDATE employees SET title_of_courtesy = 'Dr' WHERE employee_id = 10 RETURNING title_of_courtesy, last_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('Dr', 'Dow')]

In [46]:
%sql DELETE FROM employees WHERE employee_id = 10 RETURNING title_of_courtesy, last_name, first_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('Dr', 'Dow', 'John')]

## ⭕ Indexes

## ⭕ SQL Expressions

In [47]:
%sql SELECT VERSION()

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('PostgreSQL 13.3 (Debian 13.3-1.pgdg100+1) on x86_64-pc-linux-gnu, compiled by gcc (Debian 8.3.0-6) 8.3.0, 64-bit',)]

In [48]:
%sql SELECT 1+2+4.0

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(Decimal('7.0'),)]

In [49]:
%sql SELECT 1+2+4.0  = 7

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(True,)]

## ⭕ Updating Data

## Joins

### `INNER JOIN`

<center>
    <i>Only <b>Common Values</b> of two tables.</i>
</center>

![](images/join-inner.gif)

In [50]:
%%sql 

SELECT product_name, company_name, units_in_stock 
FROM products p
INNER JOIN suppliers s ON (p.supplier_id = s.supplier_id )
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Chai', 'Specialty Biscuits, Ltd.', 39),
 ('Chang', 'Exotic Liquids', 17),
 ('Aniseed Syrup', 'Exotic Liquids', 13),
 ("Chef Anton's Cajun Seasoning", 'New Orleans Cajun Delights', 53),
 ("Chef Anton's Gumbo Mix", 'New Orleans Cajun Delights', 0)]

In [51]:
%%sql 

SELECT c.category_name, SUM(p.units_in_stock)
FROM products p
INNER JOIN categories c ON (p.category_id = c.category_id)
GROUP BY c.category_id
ORDER BY sum

 * postgresql://user:***@postgresql:5432/northwind
8 rows affected.

[('Produce', 100),
 ('Meat/Poultry', 165),
 ('Grains/Cereals', 308),
 ('Confections', 386),
 ('Dairy Products', 393),
 ('Condiments', 507),
 ('Beverages', 559),
 ('Seafood', 701)]

In [52]:
%%sql 

SELECT c.category_name, SUM(p.units_in_stock * p.unit_price)
FROM products p
INNER JOIN categories c ON (p.category_id = c.category_id)
WHERE p.discontinued != 1
GROUP BY c.category_id
ORDER BY sum 
LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Produce', 2363.75),
 ('Meat/Poultry', 2916.449995994568),
 ('Grains/Cereals', 5230.5),
 ('Confections', 10392.200072288513)]

In [53]:
%%sql 

SELECT order_date, product_name, ship_country, p.unit_price
FROM orders
INNER JOIN order_details as od  ON (orders.order_id = od.order_id) 
INNER JOIN products as p ON (od.product_id = p.product_id)
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(datetime.date(1996, 7, 4), 'Queso Cabrales', 'France', 21.0),
 (datetime.date(1996, 7, 4), 'Singaporean Hokkien Fried Mee', 'France', 14.0),
 (datetime.date(1996, 7, 4), 'Mozzarella di Giovanni', 'France', 34.8),
 (datetime.date(1996, 7, 5), 'Tofu', 'Germany', 23.25),
 (datetime.date(1996, 7, 5), 'Manjimup Dried Apples', 'Germany', 53.0)]

In [54]:
%%sql 

SELECT 
    order_date, product_name, ship_country, p.unit_price,
    contact_name, company_name
FROM orders as o
JOIN order_details as od  ON (o.order_id = od.order_id) 
INNER JOIN products as p ON (od.product_id = p.product_id)
JOIN customers as c ON (o.customer_id = c.customer_id)
JOIN employees as e ON (o.employee_id = e.employee_id)
WHERE ship_country = 'USA'
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(datetime.date(1996, 7, 22), "Chef Anton's Gumbo Mix", 'USA', 21.35, 'Paula Wilson', 'Rattlesnake Canyon Grocery'),
 (datetime.date(1996, 7, 22), "Uncle Bob's Organic Dried Pears", 'USA', 30.0, 'Paula Wilson', 'Rattlesnake Canyon Grocery'),
 (datetime.date(1996, 7, 22), 'Gnocchi di nonna Alice', 'USA', 38.0, 'Paula Wilson', 'Rattlesnake Canyon Grocery'),
 (datetime.date(1996, 7, 31), 'Geitost', 'USA', 2.5, 'Karl Jablonski', 'White Clover Markets'),
 (datetime.date(1996, 7, 31), 'Mozzarella di Giovanni', 'USA', 34.8, 'Karl Jablonski', 'White Clover Markets')]

### `LEFT (OUTTER) JOIN`

<center>
    <i>Only values of the <b>the Left</b> table and <b>matches of the Right</b> tables.</i>
</center>

![](images/join-left.gif)

In [55]:
%%sql 

SELECT company_name as supplier, product_name as product
FROM suppliers as s
LEFT JOIN products as p ON (p.supplier_id = s.supplier_id )
LIMIT 3

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Exotic Liquids', 'Chang'),
 ('Exotic Liquids', 'Aniseed Syrup'),
 ('New Orleans Cajun Delights', "Chef Anton's Cajun Seasoning")]

### `LEFT (OUTTER) JOIN` <sup>*</sup>

<center>
    <i>Only values of the <b>the Left</b> table and <b>not matches of the Right</b> tables.</i>
</center>

![](images/join-left-null.gif)

In [56]:
%%sql 

SELECT company_name as customer, c.customer_id
FROM customers as c
LEFT JOIN orders as o ON (o.customer_id = c.customer_id )
WHERE order_id is NULL

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Paris spécialités', 'PARIS'),
 ('FISSA Fabrica Inter. Salchichas S.A.', 'FISSA')]

In [57]:
%%sql 

SELECT last_name, order_id
FROM employees as e
LEFT JOIN orders as o ON (o.employee_id = e.employee_id )
WHERE order_id is NULL

 * postgresql://user:***@postgresql:5432/northwind
0 rows affected.

[]

### `RIGHT (OUTTER) JOIN`

<center>
    <i>Only values of the <b>the Right</b> table and <b>matches of the Left</b> table.</i>
</center>

![](images/join-right.gif)

In [58]:
%%sql

SELECT company_name as supplier, product_name as product
FROM products as p
LEFT JOIN suppliers as s ON (p.supplier_id = s.supplier_id )
LIMIT 3

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Specialty Biscuits, Ltd.', 'Chai'),
 ('Exotic Liquids', 'Chang'),
 ('Exotic Liquids', 'Aniseed Syrup')]

### `RIGHT (OUTTER) JOIN` <sup>*</sup>

<center>
    <i>Only values of the <b>the Right</b> table and <b>not matches of the Left</b> table.</i>
</center>

![](images/join-right-null.gif)

In [59]:
%%sql 

-- same request that we did for left join.

SELECT company_name as customer, c.customer_id
FROM orders as o
RIGHT JOIN customers as c ON (o.customer_id = c.customer_id )
WHERE order_id is NULL

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[('Paris spécialités', 'PARIS'),
 ('FISSA Fabrica Inter. Salchichas S.A.', 'FISSA')]

### `FULL JOIN`

<center>
    <i><b>All</b> values <b>from left and right</b> (<b>with nulls</b> on <b>non matching values</b>) </i>
</center>

![](images/join-full.gif)

In [60]:
%%sql

SELECT company_name as customer, c.customer_id
FROM orders as o
FULL JOIN customers as c ON (o.customer_id = c.customer_id )
LIMIT 10

 * postgresql://user:***@postgresql:5432/northwind
10 rows affected.

[('Vins et alcools Chevalier', 'VINET'),
 ('Toms Spezialitäten', 'TOMSP'),
 ('Hanari Carnes', 'HANAR'),
 ('Victuailles en stock', 'VICTE'),
 ('Suprêmes délices', 'SUPRD'),
 ('Hanari Carnes', 'HANAR'),
 ('Chop-suey Chinese', 'CHOPS'),
 ('Richter Supermarkt', 'RICSU'),
 ('Wellington Importadora', 'WELLI'),
 ('HILARION-Abastos', 'HILAA')]

### `CROSS JOIN`

<center>
    <i><b>All combinations</b> of values from <b>left</b> and <b>right</b></i>
</center>

![](images/join-cross.gif)

In [61]:
%%sql

SELECT count(*)
FROM orders as o
CROSS JOIN customers as c

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(75530,)]

### `SELF JOIN`

In [62]:
%%sql

CREATE TABLE IF NOT EXISTS extras_self_join_example (
    id   INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    pid  INT,
    
    FOREIGN KEY (pid) REFERENCES extras_self_join_example (id)
);

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [63]:
%%sql 

INSERT INTO extras_self_join_example (
    id, name, pid
) VALUES
(1, 'Foo', NULL),
(2, 'Bar', 1),
(3, 'Baz', 2),
(4, 'Quz', 1);

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[]

In [64]:
%%sql

SELECT e.name || '/' || e2.name, e2.pid
FROM extras_self_join_example as e
LEFT JOIN extras_self_join_example as e2 ON e2.pid = e.id
WHERE e2.pid IS NOT NULL
ORDER BY e2.pid DESC

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Bar/Baz', 2), ('Foo/Bar', 1), ('Foo/Quz', 1)]

In [65]:
%sql DROP TABLE extras_self_join_example

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

### `USING` keyword

_Allows to use shared column to make join_

In [66]:
%%sql 

SELECT product_name, company_name, units_in_stock 
FROM products p
INNER JOIN suppliers USING(supplier_id)
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Chai', 'Specialty Biscuits, Ltd.', 39),
 ('Chang', 'Exotic Liquids', 17),
 ('Aniseed Syrup', 'Exotic Liquids', 13),
 ("Chef Anton's Cajun Seasoning", 'New Orleans Cajun Delights', 53),
 ("Chef Anton's Gumbo Mix", 'New Orleans Cajun Delights', 0)]

### `NATURAL JOIN`

_Joining tables using columns with same name_

In [67]:
%%sql 

SELECT product_name, company_name, units_in_stock 
FROM products p
NATURAL JOIN suppliers 
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Chai', 'Specialty Biscuits, Ltd.', 39),
 ('Chang', 'Exotic Liquids', 17),
 ('Aniseed Syrup', 'Exotic Liquids', 13),
 ("Chef Anton's Cajun Seasoning", 'New Orleans Cajun Delights', 53),
 ("Chef Anton's Gumbo Mix", 'New Orleans Cajun Delights', 0)]

## SubQueries

In [68]:
%%sql 

SELECT company_name, country 
FROM suppliers as s
WHERE s.country IN (
    SELECT DISTINCT(country) FROM customers
) 
ORDER BY s.company_name 
LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Aux joyeux ecclésiastiques', 'France'),
 ('Bigfoot Breweries', 'USA'),
 ("Cooperativa de Quesos 'Las Cabras'", 'Spain'),
 ('Escargots Nouveaux', 'France')]

In [69]:
%%sql 

SELECT DISTINCT(s.company_name), country 
FROM suppliers as s 
JOIN customers as c USING(country) 
ORDER BY s.company_name  
LIMIT 4

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Aux joyeux ecclésiastiques', 'France'),
 ('Bigfoot Breweries', 'USA'),
 ("Cooperativa de Quesos 'Las Cabras'", 'Spain'),
 ('Escargots Nouveaux', 'France')]

In [70]:
%%sql 

SELECT category_name, SUM(units_in_stock)
FROM products
INNER JOIN categories USING(category_id)
GROUP BY category_name
ORDER BY sum desc
LIMIT (SELECT MIN(product_id)+4 FROM PRODUCTS)

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Seafood', 701),
 ('Beverages', 559),
 ('Condiments', 507),
 ('Dairy Products', 393),
 ('Confections', 386)]

In [71]:
%%sql 

SELECT product_name, units_in_stock
FROM products
WHERE units_in_stock > (SELECT AVG(units_in_stock) FROM products)
ORDER BY units_in_stock DESC
LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Rhönbräu Klosterbier', 125),
 ('Boston Crab Meat', 123),
 ("Grandma's Boysenberry Spread", 120),
 ('Pâté chinois', 115),
 ("Sirop d'érable", 113)]

### `EXISTS`

In [72]:
%%sql

-- join like experience

SELECT company_name, contact_name
FROM customers
WHERE EXISTS (
    SELECT customer_id FROM orders WHERE customer_id = customers.customer_id and freight > 800
)

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Queen Cozinha', 'Lúcia Carvalho'),
 ('QUICK-Stop', 'Horst Kloss'),
 ('Save-a-lot Markets', 'Jose Pavarotti')]

In [73]:
%%sql 

SELECT c.company_name, c.contact_name, o.freight
FROM customers as c
INNER JOIN orders as o ON (o.customer_id = c.customer_id and o.freight > 800)

 * postgresql://user:***@postgresql:5432/northwind
4 rows affected.

[('Queen Cozinha', 'Lúcia Carvalho', 890.78),
 ('QUICK-Stop', 'Horst Kloss', 1007.64),
 ('QUICK-Stop', 'Horst Kloss', 810.05),
 ('Save-a-lot Markets', 'Jose Pavarotti', 830.75)]

### `ANY`

In [74]:
%%sql 

SELECT DISTINCT(company_name)
FROM customers
JOIN orders USING (customer_id)
JOIN order_details USING (order_id)
WHERE quantity > 100

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Ernst Handel',), ('QUICK-Stop',), ('Save-a-lot Markets',)]

In [75]:
%%sql 

SELECT DISTINCT(company_name)
FROM customers
WHERE customer_id = ANY(SELECT customer_id FROM orders JOIN order_details USING(order_id) WHERE quantity > 100)

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[('Ernst Handel',), ('QUICK-Stop',), ('Save-a-lot Markets',)]

In [76]:
%%sql 

SELECT DISTINCT p.product_name, od.quantity
FROM products as p
JOIN order_details as od USING(product_id)
WHERE od.quantity > (SELECT AVG(quantity) from order_details)
ORDER BY quantity
LIMIT 3

 * postgresql://user:***@postgresql:5432/northwind
3 rows affected.

[("Jack's New England Clam Chowder", 24),
 ("Chef Anton's Cajun Seasoning", 24),
 ('Pavlova', 24)]

## ⭕ Views

In [77]:
%%sql 

CREATE VIEW view_products_of_suppliers as 
SELECT product_name, company_name, units_in_stock 
FROM products p
INNER JOIN suppliers s ON (p.supplier_id = s.supplier_id )

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [78]:
%%sql 

SELECT * FROM view_products_of_suppliers LIMIT 5

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[('Chai', 'Specialty Biscuits, Ltd.', 39),
 ('Chang', 'Exotic Liquids', 17),
 ('Aniseed Syrup', 'Exotic Liquids', 13),
 ("Chef Anton's Cajun Seasoning", 'New Orleans Cajun Delights', 53),
 ("Chef Anton's Gumbo Mix", 'New Orleans Cajun Delights', 0)]

### Droping Views

In [79]:
%%sql 

DROP VIEW view_products_of_suppliers;

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

### Create Or Replace Views

In [80]:
%%sql

CREATE OR REPLACE VIEW view_products_of_suppliers as 
SELECT  company_name, product_name, units_in_stock 
FROM products p
INNER JOIN suppliers s ON (p.supplier_id = s.supplier_id )

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

https://www.postgresql.org/docs/13/sql-alterview.html

In [81]:
%%sql 

ALTER VIEW view_products_of_suppliers 
RENAME TO products_of_suppliers_relation;

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

### Inserting Into the Views

In [82]:
%%sql

DROP VIEW IF EXISTS "empl_mrs";
CREATE VIEW "empl_mrs" as SELECT * FROM employees WHERE title_of_courtesy = 'Mrs'

 * postgresql://user:***@postgresql:5432/northwind
Done.
Done.

[]

In [83]:
%%sql

INSERT INTO employees (employee_id, first_name, last_name, title_of_courtesy)
VALUES (11, 'Johnna', 'Dow', 'Ms')
RETURNING title_of_courtesy, first_name, last_name

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('Ms', 'Johnna', 'Dow')]

#### TODO: Adding checks to prevent bypassing filters

* WITH LOCAL CHECK OPTION;
* WITH CASCADE CHECK OPTION;

## ⭕ Importing and Exporting data

## ⭕ User Variables

## ⭕ Prepared Statements

## ⭕ Stored Procedures and Functions

### ⭕ Procedures

In [84]:
%%sql 

DROP PROCEDURE IF EXISTS test_proc();
CREATE PROCEDURE test_proc()
AS $$ 
    BEGIN
        CREATE TABLE IF NOT EXISTS a (aid int);
        CREATE TABLE IF NOT EXISTS b (bid int); 
    COMMIT;
        CREATE TABLE IF NOT EXISTS c (cid int);
    ROLLBACK;
    END; 
$$ LANGUAGE plpgsql;

 * postgresql://user:***@postgresql:5432/northwind
Done.
Done.

[]

In [85]:
%sql CALL test_proc();

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [86]:
%%sql

DROP table IF EXISTS a;
DROP table IF EXISTS b;
DROP table IF EXISTS c;

 * postgresql://user:***@postgresql:5432/northwind
Done.
Done.
Done.

[]

### Functions: SQL

Selecting data from table

In [87]:
%%sql

CREATE OR REPLACE FUNCTION get_product_price_by_name(name varchar) RETURNS real AS $$
    SELECT unit_price FROM products WHERE product_name = name
$$  LANGUAGE SQL;

SELECT * FROM get_product_price_by_name('Tofu')

 * postgresql://user:***@postgresql:5432/northwind
Done.
1 rows affected.

[(23.25,)]

In [88]:
%%sql

CREATE OR REPLACE FUNCTION get_total_number_of_goods() RETURNS bigint as $$
    SELECT sum(units_in_stock) FROM products
$$ LANGUAGE sql;

SELECT get_total_number_of_goods();

 * postgresql://user:***@postgresql:5432/northwind
Done.
1 rows affected.

[(3119,)]

#### `OUT` parameters

In [89]:
%%sql

CREATE OR REPLACE FUNCTION get_product_priceboundaries(OUT max_price real, OUT min_price real) AS $$
    SELECT MAX(unit_price), MIN(unit_price) FROM products
$$  LANGUAGE SQL;

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [90]:
%sql SELECT get_product_priceboundaries()

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('(263.5,2.5)',)]

In [91]:
%sql SELECT * FROM get_product_priceboundaries()

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(263.5, 2.5)]

In [92]:
%sql SELECT min_price, max_price FROM get_product_priceboundaries()

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(2.5, 263.5)]

#### DEFAULT parameters

In [93]:
%%sql

CREATE OR REPLACE FUNCTION get_product_price_boundaries_by_discontinueity(
    IN is_discontinued INT DEFAULT 0, 
    OUT max_price real, 
    OUT min_price real
) AS $$
    SELECT MAX(unit_price), MIN(unit_price) FROM products
    WHERE discontinued = is_discontinued
$$  LANGUAGE SQL;

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [94]:
%sql SELECT * FROM get_product_price_boundaries_by_discontinueity()

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(263.5, 2.5)]

In [95]:
%sql SELECT * FROM get_product_price_boundaries_by_discontinueity(0)

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(263.5, 2.5)]

In [96]:
%sql SELECT * FROM get_product_price_boundaries_by_discontinueity(1)

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(123.79, 4.5)]

#### `DECLARE` Variables

In [97]:
%%sql

CREATE OR REPLACE FUNCTION get_triangle_square(a real, b real, c real) RETURNS real AS $$
    
    -- p for perimeter
    DECLARE p real;
    BEGIN
        p = (a+b+c) / 2;
        return sqrt(p) * (p-a) * (p-b) * (p-c);
    END;
$$  LANGUAGE plpgsql;

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

In [98]:
%sql SELECT get_triangle_square(6,6,6)

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[(81.0,)]

#### ⭕ TODO IF/ELSEIF

#### SETOF `[table]`

In [99]:
%%sql

CREATE OR REPLACE FUNCTION get_price_in_range() RETURNS SETOF products AS $$
    
    DECLARE 
        avg_price real;
        max_price real;
    
    BEGIN
        SELECT avg(unit_price) 
        INTO avg_price 
        FROM products;
        
        -- in case if need somewhere else
        max_price = avg_price * 1.05 ;  
        
        RETURN QUERY
        SELECT * FROM products
        WHERE unit_price BETWEEN (avg_price * 0.95) and max_price;
    END;
$$  LANGUAGE plpgsql;

SELECT product_id, product_name FROM get_price_in_range();

 * postgresql://user:***@postgresql:5432/northwind
Done.
2 rows affected.

[(7, "Uncle Bob's Organic Dried Pears"), (61, "Sirop d'érable")]

### `RETURN NEXT`

In [100]:
%%sql

CREATE OR REPLACE FUNCTION return_ints() RETURNS SETOF int AS $$
    BEGIN
        RETURN NEXT 1;
        RETURN NEXT 3;
        RETURN NEXT 2;
    END
$$ LANGUAGE plpgsql;

SELECT return_ints();

 * postgresql://user:***@postgresql:5432/northwind
Done.
3 rows affected.

[(1,), (3,), (2,)]

### Quick Proofing

In [101]:
%%sql

DROP TABLE IF EXISTS tmp_customers;
SELECT * INTO tmp_customers FROM customers;

CREATE OR REPLACE FUNCTION update_null_region_in_customers() RETURNS void as $$
    UPDATE tmp_customers SET region = 'unknown' WHERE region is NULL
$$ LANGUAGE SQL;

SELECT update_null_region_in_customers();

 * postgresql://user:***@postgresql:5432/northwind
Done.
91 rows affected.
Done.
1 rows affected.

[(None,)]

## Counter

In [102]:
%%sql


DO $$
BEGIN
    FOR counter IN 1...10 BY 2
    LOOP
        RAISE NOTICE 'counter:... %', counter;
    END LOOP;
END$$

 * postgresql://user:***@postgresql:5432/northwind
Done.

[]

## ⭕ Built-in Functions

### `regexp_matches`

In [103]:
%%sql 

SELECT regexp_matches ('<user2@mail.de,user3@mail.de>', '\w[\w.+-]*@[\w.-]+\.[\w-]{2,63}', 'g');

 * postgresql://user:***@postgresql:5432/northwind
2 rows affected.

[(['user2@mail.de'],), (['user3@mail.de'],)]

### `NULLIF(a,b)` - returns `NULL` if `a == b`

In [104]:
%sql SELECT NULLIF('foo', 'bar'), NULLIF('foo', 'foo'), NULLIF(1, 0)

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('foo', None, 1)]

### `COALESCE(a,b)` - prefer `b` if `a == null`

In [105]:
%sql SELECT COALESCE (Null, 'var'), COALESCE ('foo', 'bar')

 * postgresql://user:***@postgresql:5432/northwind
1 rows affected.

[('var', 'foo')]

### `CASE` ... `END` - if else blocks

In [106]:
%%sql 

SELECT 
    order_id, 
    customer_id,
    quantity,
    CASE
        WHEN quantity >= 100 THEN 'a lot' 
        WHEN quantity >= 40 THEN 'average' 
        WHEN quantity >= 20 THEN 'normal amount' 
        ELSE 'too few'
    END as how_much
FROM orders 
INNER JOIN order_details USING(order_id)
WHERE quantity > 10
     and order_id in (11072, 10571)
ORDER BY how_much
LIMIT 10

 * postgresql://user:***@postgresql:5432/northwind
5 rows affected.

[(11072, 'ERNSH', 130, 'a lot'),
 (11072, 'ERNSH', 40, 'average'),
 (10571, 'ERNSH', 28, 'normal amount'),
 (11072, 'ERNSH', 22, 'normal amount'),
 (10571, 'ERNSH', 11, 'too few')]

## ⭕ Triggers

## ⭕ DataBase Metadata

## ⭕ Document Model

* https://app.pluralsight.com/library/courses/postgresql-document-database/table-of-contents


create or replace funcname(int) return data as $$

--
SELECT * INTO tmp_customers FROM customes;